#### Q1. List any five functions of the pandas library with execution.

In [2]:
import pandas as pd

In [2]:
sample_dict = {
    "name": ["John","Abraham","Saif","John","Abraham","Saif"],
    "age": [30,45,60,30,45,60],
    "city": ["New York","Chennai","Mumbai","New York","Chennai","Mumbai"],
    "occupation": ["Engineer","Actor","Doctor","Engineer","Actor","Doctor"]
}

df = pd.DataFrame(sample_dict)

In [3]:
df.head()

      name  age      city occupation
0     John   30  New York   Engineer
1  Abraham   45   Chennai      Actor
2     Saif   60    Mumbai     Doctor
3     John   30  New York   Engineer
4  Abraham   45   Chennai      Actor

In [4]:
df.tail()

      name  age      city occupation
1  Abraham   45   Chennai      Actor
2     Saif   60    Mumbai     Doctor
3     John   30  New York   Engineer
4  Abraham   45   Chennai      Actor
5     Saif   60    Mumbai     Doctor

In [5]:
df['name'].value_counts()

John       2
Abraham    2
Saif       2
Name: name, dtype: int64

In [6]:
df['age'].unique()

array([30, 45, 60])

#### Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [7]:
data = {'A': [10, 20, 30], 'B': [40, 50, 60], 'C': [70, 80, 90]}
df = pd.DataFrame(data)
df

    A   B   C
0  10  40  70
1  20  50  80
2  30  60  90

In [8]:
def reindex_dataframe(df):
    new_index = range(1, len(df) * 2, 2)
    df.index = new_index
    return df

In [9]:
df = reindex_dataframe(df)

print(df)

    A   B   C
1  10  40  70
3  20  50  80
5  30  60  90

### Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.

In [10]:
data1 = {'Values': [10, 20, 30,40,50]}
df = pd.DataFrame(data1)
df

   Values
0      10
1      20
2      30
3      40
4      50

In [11]:
data2=df.head(3)
data2
add=data2.sum()
print(add)

Values    60
dtype: int64

#### Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [12]:
sample_dict = {
    "Text": ["Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column."]
    
}
data=pd.DataFrame(sample_dict)
pd.set_option('display.max_colwidth',1000)
data

                                                                                                                                                                                Text
0  Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [13]:
data['Word_Count']=data['Text'].apply(lambda x:len(x.split(' ')))
data

,Text,Word_Count
0,"Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.",32

#### Q5. How are DataFrame.size() and DataFrame.shape() different?

In [14]:
data1 = {'A': [10, 20, 30], 'B': [40, 50, 60], 'C': [70, 80, 90]}
df = pd.DataFrame(data1)
df

    A   B   C
0  10  40  70
1  20  50  80
2  30  60  90

In [15]:
df.size # Returns the product of the number of rows and columns in a dataframe

9

In [16]:
df.shape # Returns the dimensions of a dataframe with first element being rows and second being columns

(3, 3)

#### Q6. Which function of pandas do we use to read an excel file?

#### pd.read_excel() is used to read an excel file

#### Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.

In [17]:
data = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 30, 22],
        'Email': ['alice@egmail.com', 'bob@egmail.com', 'charlie@egmail.com']}


df = pd.DataFrame(data)
df

      Name  Age               Email
0    Alice   25    alice@egmail.com
1      Bob   30      bob@egmail.com
2  Charlie   22  charlie@egmail.com

In [18]:
df['Username']=df['Email'].str.split('@').str[0]

In [19]:
df

      Name  Age               Email Username
0    Alice   25    alice@egmail.com    alice
1      Bob   30      bob@egmail.com      bob
2  Charlie   22  charlie@egmail.com  charlie

#### Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows. For example, if df contains the following values:
#### A B C
#### 0 3 5 1
#### 1 8 2 7
#### 2 6 9 4
#### 3 2 3 5
#### 4 9 1 2
#### Your function should select the following rows: 
#### A B C
#### 1 8 2 7
#### 4 9 1 2
#### The function should return a new DataFrame that contains only the selected rows.

In [20]:
df={
'A':[3,8,6,2,9],
'B':[5,2,9,3,1],
'C':[1,7,4,5,2]

}
df = pd.DataFrame(df)

In [21]:
df[(df['A']>5) & (df['B']<10)]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

#### Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,median, and standard deviation of the values in the 'Values' column.

In [22]:
df={'Values':[3,8,6,2,9,2,3,3,4]}
df=pd.DataFrame(df)

In [23]:
df.mean()

Values    4.444444
dtype: float64

In [24]:
df.median()

Values    3.0
dtype: float64

In [25]:
import scipy.stats as stat
stat.mode(df)

/tmp/ipykernel_595/1844543960.py:2: FutureWarning: Unlike other reduction functions (e.g. `skew`, `kurtosis`), the default behavior of `mode` typically preserves the axis it acts along. In SciPy 1.11.0, this behavior will change: the default value of `keepdims` will become False, the `axis` over which the statistic is taken will be eliminated, and the value None will no longer be accepted. Set `keepdims` to True or False to avoid this warning.
  stat.mode(df)

ModeResult(mode=array([[3]]), count=array([[3]]))

#### Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [30]:
sales={
'sales':[2000,3000,2500,1000,2563,9000,10000],
'Date':['2023-10-01', '2023-10-02', '2023-10-03', '2023-10-04', '2023-10-05', '2023-10-06', '2023-10-07']}

In [31]:
df=pd.DataFrame(sales)

In [32]:
df

   sales        Date
0   2000  2023-10-01
1   3000  2023-10-02
2   2500  2023-10-03
3   1000  2023-10-04
4   2563  2023-10-05
5   9000  2023-10-06
6  10000  2023-10-07

In [38]:
df['MovingAverage']=df['sales'].rolling(window=7,min_periods=1).mean()

In [39]:
df

   sales        Date  MovingAverage
0   2000  2023-10-01    2000.000000
1   3000  2023-10-02    2500.000000
2   2500  2023-10-03    2500.000000
3   1000  2023-10-04    2125.000000
4   2563  2023-10-05    2212.600000
5   9000  2023-10-06    3343.833333
6  10000  2023-10-07    4294.714286

#### Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.Monday, Tuesday) corresponding to each date in the 'Date' column.
#### For example, if df contains the following values:
#### Date
0 2023-01-01

1 2023-01-02

2 2023-01-03

3 2023-01-04

4 2023-01-05

#### Your function should create the following DataFrame:

Date Weekday

0 2023-01-01 Sunday

1 2023-01-02 Monday

2 2023-01-03 Tuesday

3 2023-01-04 Wednesday

4 2023-01-05 Thursday

#### The function should return the modified DataFrame.

In [40]:
df={'Date':['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05']}

In [43]:
df=pd.DataFrame(df)
df

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05

In [50]:
df['Date']=pd.to_datetime(df['Date'])

In [52]:
df['Weekday']=df['Date'].dt.day_name()

In [53]:
df

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

#### Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [12]:
Date = pd.date_range(start='2023-01-01',end='2023-02-10',  freq='D')

# Create a DataFrame with a 'Date' column
df = pd.DataFrame({'Date': Date})

# Print the DataFrame
print(df)

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06
6  2023-01-07
7  2023-01-08
8  2023-01-09
9  2023-01-10
10 2023-01-11
11 2023-01-12
12 2023-01-13
13 2023-01-14
14 2023-01-15
15 2023-01-16
16 2023-01-17
17 2023-01-18
18 2023-01-19
19 2023-01-20
20 2023-01-21
21 2023-01-22
22 2023-01-23
23 2023-01-24
24 2023-01-25
25 2023-01-26
26 2023-01-27
27 2023-01-28
28 2023-01-29
29 2023-01-30
30 2023-01-31
31 2023-02-01
32 2023-02-02
33 2023-02-03
34 2023-02-04
35 2023-02-05
36 2023-02-06
37 2023-02-07
38 2023-02-08
39 2023-02-09
40 2023-02-10

In [13]:

# Select the rows between two dates
in_range_df = df[df["Date"].isin(pd.date_range('2023-01-01', '2023-01-31'))]

print(in_range_df)  # print result

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06
6  2023-01-07
7  2023-01-08
8  2023-01-09
9  2023-01-10
10 2023-01-11
11 2023-01-12
12 2023-01-13
13 2023-01-14
14 2023-01-15
15 2023-01-16
16 2023-01-17
17 2023-01-18
18 2023-01-19
19 2023-01-20
20 2023-01-21
21 2023-01-22
22 2023-01-23
23 2023-01-24
24 2023-01-25
25 2023-01-26
26 2023-01-27
27 2023-01-28
28 2023-01-29
29 2023-01-30
30 2023-01-31

#### Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

In [14]:
import pandas as pd